[
  {
    "id": 166189,
    "title": "@carlton @s.anand dear sir i have taken tds in this term. after the first assignment there was no checkbox provided to any graded assignment .for this reason i just saved the assignment at the portal link .and now after the deadline i...",
    "created_at": "2025-02-03",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/166189"
  },
  {
    "id": 171625,
    "title": "Grading Document - \"The calculation of Final course Score for eligible students is as follows: GAA1 = Average score in Best 10 objective assignments out of First 11 graded objective assignments GAA2 = Average score in Best 10 programming assignments out of First 11 graded programming assignments\"...",
    "created_at": "2025-04-02",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/171625"
  },
  {
    "id": 164570,
    "title": "My specific doubt is on the topic: clarification on points reduction My doubt is: Recently I have submitted my programming graded assignments. In the grading system there are two parts Public Test Case and Private Test Case. As per my understanding the Public Test Case evaluates the given...",
    "created_at": "2025-01-22",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/164570"
  },
  {
    "id": 172192,
    "title": "I faced a few issues during the DBMS OPPE and with the final assignment grading that I would like to seek clarification on: OPPE Python‑PostgreSQL Question: While attempting the Python‑PostgreSQL question, I imported all...",
    "created_at": "2025-04-09",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/172192"
  },
  {
    "id": 171524,
    "title": "Dear Learner, We have released the Week 11 Contents &amp; Assignment. The deadline for the Week 11 Graded Assignment is 02/04/2025 at 23:59 Hrs. Please refer to the Grading document for more details. However, the Week...",
    "created_at": "2025-04-01",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/171524"
  },
  {
    "id": 166911,
    "title": "@satyanarayana @AtulPS Sir, In week 4 PDSA Graded Assignment I've scored 12.33 out of 15 marks. But in dashboard it is showing as 50% only. Regarding this I've mailed to support But they replied that marks calc...",
    "created_at": "2025-02-13",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/166911"
  },
  {
    "id": 166897,
    "title": "Sir/Madam, I hope this message finds you well. I am writing to bring to your attention a discrepancy I have noticed regarding my Week 3 Python assignment score on the portal. While reviewing my Dashboard, I observed that my score for the Week 3 Python assignment is displayed as 88%. However, upon check...",
    "created_at": "2025-02-13",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/166897"
  },
  {
    "id": 166863,
    "title": "In week 4 PDSA graded assignment , i made only one 1 mark question wrong but total percentage of week 4 graded assignment came up to be 50%. Total marks for the graded assignment was...",
    "created_at": "2025-02-12",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/166863"
  },
  {
    "id": 166729,
    "title": "Hello Sir/Ma'am, I have successfully run and got 100/100 during test run on MAD1 week 3 lab assignment. And after getting 100/100 on test run I have submitted my lab assignment successfully. But now I am facing problem with my grade. It is showing 1/10...",
    "created_at": "2025-02-10",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/166729"
  },
  {
    "id": 165740,
    "title": "I have got 100/100 in test run score but Due to website issue I`m unable to submit my Lab assignment. I tried everything like opening time incognito mode and trying to submit lab assignment in my phone and also in my laptop. I also turn off an on my...",
    "created_at": "2025-01-29",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/165740"
  },
  {
    "id": 172412,
    "title": "Can someone please upload the answer key to week 12 assignment? It should have been automatically available once the answers were published for the graded assignment.",
    "created_at": "2025-04-11",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/172412"
  },
  {
    "id": 169905,
    "title": "...ry more effectively. You can remove this portion while posting your query ) My specific doubt is on the topic: My doubt is: image I Got full marks in assignment and GRPA but on dashboard its showing 75 &amp; 50 Recommended: Mention what you have done till now to find clarification on the doubt:",
    "created_at": "2025-03-14",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/169905"
  },
  {
    "id": 169080,
    "title": "I missed the submission deadline for the Week 6 and 7 assignments for System Commands, Java and MAD 2 due to the mixed OPPE exam format and not receiving deadline reminders. Could I please be allowed to submit the...",
    "created_at": "2025-03-03",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/169080"
  },
  {
    "id": 169026,
    "title": "...m, I hope you are doing well. Due to the OPPE and ROE yesterday, some of us, including myself, unintentionally overlooked the deadline for our graded assignments. We sincerely apologize for this oversight. If possible, we kindly request an extension until today to submit our assignments. We would be extremely...",
    "created_at": "2025-03-03",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/169026"
  },
  {
    "id": 158694,
    "title": "This has happened again. What purpose does it serve IITM to keep random deadlines. Not everyone is a student here who keeps a watch on assignment deadlines etc. some of us are working professionals and it is not always possible to submit assignments days before deadline. Statistics 2 mock for q...",
    "created_at": "2025-02-21",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/158694"
  },
  {
    "id": 166816,
    "title": "hello sir this is Harish. i completed and saved the week 2 and week 4 assignment. (didn't do week 3) but the graded assignment shows it is incomplete and the score is 0 for both the weeks . i am attaching the iages. kindly check a...",
    "created_at": "2025-02-11",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/166816"
  },
  {
    "id": 166927,
    "title": "...cific doubt is on the topic: &lt; week 2 and 3 of maths 1, foundation level &gt; My doubt is: &lt; Hello, could someone please guide me? In week 3 math graded assignment, half of my answers are not showing, it is blank which led to major deductions. In maths week 2 question 12, I got the correct answer, which was -9 b...",
    "created_at": "2025-02-13",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/166927"
  },
  {
    "id": 166848,
    "title": "...IIT Madras online degree program. I am writing to bring to your attention a discrepancy in the marks displayed on my dashboard for Week 1 and Week 3 assignments. While I have submitted my assignments on time and scored full marks (100/100) as confirmed by the feedback provided, the dashboard incorrectly refl...",
    "created_at": "2025-02-12",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/166848"
  },
  {
    "id": 166372,
    "title": "My specific doubt is on the topic:week 3 grpa 3 assignment submission My doubt is: i was not able to submit my week 3 : grpa 3 and grpa 4 of Python Course in Foundation Term due to the failure on the website....",
    "created_at": "2025-02-05",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/166372"
  },
  {
    "id": 166227,
    "title": "image I see this type of programming assignment of in my Week 4 Statistics, What is this, how to do and why I didn't see this assignment in Week 4 while I am Qualifier, Is Qualifier and direct entr...",
    "created_at": "2025-02-03",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/166227"
  },
  {
    "id": 164556,
    "title": "(Make sure that you have applied a tag while posting. Use the below template while posting your queries in the forum. Both these actions from your end will help the course instructors and peers to address your query more effectively. You can remove this portion while posting your query ) My speci...",
    "created_at": "2025-01-22",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/164556"
  },
  {
    "id": 163374,
    "title": "My specific doubt is on the topic: My doubt is: where and how to access week 1 contents and assignments Recommended: Mention what you have done till now to find clarification on the doubt:",
    "created_at": "2025-01-15",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/163374"
  },
  {
    "id": 85326,
    "title": "does bonus marks also include attempting AQs of each week?",
    "created_at": "2025-04-12",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/85326"
  },
  {
    "id": 172320,
    "title": "I noticed that my \"Average Assignment for final Scoring\" is considering first 10 weeks assignments only. My understanding being that this score takes average of best 10 weeks. Could you p...",
    "created_at": "2025-04-10",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/172320"
  },
  {
    "id": 171416,
    "title": "This week, I had two OPPE exams and APP Dev project submission deadline, all scheduled for the 30th. Additionally, there was the assignment submission deadline for Weeks 10 and 11 at the diploma level. Due to the overwhelming workload and time constraints, I, along with many of my peers,...",
    "created_at": "2025-03-31",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/171416"
  },
  {
    "id": 171073,
    "title": "@PiyushW Many have OPPE on 30 Mar. The Graded Assignment 10 is also due on 30 Mar. Since the Graded Assignment 11 is NOT considered for the final grade, It would be better to extend the due date for Graded...",
    "created_at": "2025-03-27",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/171073"
  },
  {
    "id": 170957,
    "title": "Where to access solutions for week 9 practice assignment? it's not available on the site. Recommended: Mention what you have done till now to find clarification on the doubt:",
    "created_at": "2025-03-25",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/170957"
  },
  {
    "id": 169086,
    "title": "Good Afternoon, I can guarantee that I had submitted the assignment on time and properly, however today when I checked Assignment 1, the first half was not submitted. and Assignment 2 was not submitted in its entirety...",
    "created_at": "2025-03-03",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/169086"
  },
  {
    "id": 169047,
    "title": "Screenshot 2025-03-03 at 1.09.40 PM In this question, for A = [[1 0 0] [0 1 0] [0 0 1]], Ax = x, Ay = y, Az = z and all x, y, z are eigenvectors of A. This also satisfies A = A^T. For A = [[1 1 0] [1 1 1] [0 1 1]], Ay = (2, 3, 2) != λy. This also satisfies A = A^T. So we have matrices A that sati...",
    "created_at": "2025-03-03",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/169047"
  },
  {
    "id": 170512,
    "title": "all assignment in week 11 are PPA there is no graded assignment but we get Notification that The deadline for the Week 11 Graded Assignment is 02/04/2025 23:59 Hrs....",
    "created_at": "2025-03-20",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/170512"
  },
  {
    "id": 169864,
    "title": "IMG_0558 IMG_0559 Please explain me the logic of solving these 2 questions.",
    "created_at": "2025-03-14",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/169864"
  },
  {
    "id": 169439,
    "title": "...and peers to address your query more effectively. You can remove this portion while posting your query ) My specific doubt is on the topic: &lt; graded assignment 7 and end term eligibility &gt; My doubt is: &lt; I have submitted the graded assignment 7 and I also rechecked it twice because I knew it is necessary for...",
    "created_at": "2025-03-08",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/169439"
  },
  {
    "id": 169353,
    "title": "sir, I received an incorrect score for question number 4 on my Maths-1 (Week-7) Graded Assignment. I have attached a screenshot of my work and the grade I received. Please review it and correct the score to the appropriate mark. Thank you for your...",
    "created_at": "2025-03-07",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/169353"
  },
  {
    "id": 169288,
    "title": "Dear IITM Team, I understand that IITM has a strict policy against relaxing assignment eligibility criteria or extending deadlines. However, I would like to respectfully request your consideration regarding my current situation. I recen...",
    "created_at": "2025-03-06",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/169288"
  },
  {
    "id": 169286,
    "title": "I'm totally aware that IITM does not tolerate, assignment relaxation realted to eligibility and does not extend deadlines. However , the eligiblity was changed this term from Best 5 out 9 to Best 5 out of 7...",
    "created_at": "2025-03-06",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/169286"
  },
  {
    "id": 168805,
    "title": "My specific doubt is on the topic: Combination and Permutation My doubt is: image Here, What is \"irrespective of direction\" means? Recommended: Mention what you have done till now to find clarification on the doubt: As far my understand, \"irrespective of direction\" means, The direction of travel ...",
    "created_at": "2025-03-01",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/168805"
  },
  {
    "id": 168784,
    "title": "Sir, There is quite a bit of discrepancy in my GA marks so far [between Q &amp; A and Dashboard]. [GRPA marks are correct] Python GA in dash board GA score actual on Q &amp; A GRPA in dash board GRPA actual Total Week 1 83 67 491 491 Week 2 85 93 386 386 Week 3 45 90 0 0 Week 4 91 91 200 200 Week 5 56 91...",
    "created_at": "2025-02-28",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/168784"
  },
  {
    "id": 168736,
    "title": "My doubt is: In week 6 Collections 1 graded assignment, my test cases have been passes but private tests are failing. Can anyone point out if there is any error in my code? 1000197947 Recommended: Mention...",
    "created_at": "2025-02-28",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/168736"
  },
  {
    "id": 167991,
    "title": "I have submitted my graded assignment based on the datasheet provided as a link in the portal. However on checking my result, I found all the assignment answers are wrong for the JAN grad...",
    "created_at": "2025-02-21",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/167991"
  },
  {
    "id": 167703,
    "title": "Dear support, I am not able to access Graded assignment solutions for DBMS course. It says no access. But I am currently enrolled in the course. Kindly request to resolve this please. @support @PiyushW @Ma...",
    "created_at": "2025-02-19",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/167703"
  },
  {
    "id": 167362,
    "title": "python assignments I see these assignments in python, are these assignments Graded? What if I don't submit them?",
    "created_at": "2025-02-16",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/167362"
  },
  {
    "id": 166859,
    "title": "Incorrect graded-assignment score in PDSA Week-4 . I did two questions wrong but my overall score is showing 50 which is not possible it should have been 86 or 87",
    "created_at": "2025-02-12",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/166859"
  },
  {
    "id": 166727,
    "title": "In this question of week 2 statistics, there was a similar question in practice assignment and I solved using the same process but my answer is not matching, can someone explain? 1000192941 1000192943 1000192945",
    "created_at": "2025-02-10",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/166727"
  },
  {
    "id": 166284,
    "title": "See the Graded Assignment Question 10. GA3_Q10_screen There is syntax error in the code as compared to the lecture slide . The &lt; / &gt; LANGUAGE plpgsql like statement is followe...",
    "created_at": "2025-02-04",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/166284"
  },
  {
    "id": 166244,
    "title": "My specific doubt is on the topic: Error in marking of a question in graded assignment My doubt is: Respected sir/mam, I Shweta Kandhare am a student of IITM BSC programme. Actually in graded assignment of week 2 in question no. 8 I hav...",
    "created_at": "2025-02-04",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/166244"
  },
  {
    "id": 166024,
    "title": "is anyone facing issue with question 2 of graded programming assignment, i could validate the answer manually which is written by sql query but is not accepted.",
    "created_at": "2025-02-01",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/166024"
  },
  {
    "id": 165396,
    "title": "Hello, I submitted my graded assignment for TDS course. But unfortunately I did not see the question in the portal asking if I have seen all questions and attended the exam. Can someone ple...",
    "created_at": "2025-01-26",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/165396"
  },
  {
    "id": 165660,
    "title": "My specific doubt is on the topic: &lt; statistics 1 week 1 graded assignment question Screenshot_20250128-223542~2 My doubt is: Recommended: Mention what you have done till now to find clarification on the doubt:",
    "created_at": "2025-01-28",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/165660"
  },
  {
    "id": 165355,
    "title": "Week 2 Practice assignment, Q 10 My doubt is: How can a string value be inserted in an int attribute?? the last option shouldn't be a valid answer, but is says so in the correc...",
    "created_at": "2025-01-26",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/165355"
  },
  {
    "id": 165287,
    "title": "image My doubt is: In the grades page, it shows 100 for my week 1 objective graded assignment and evaluation pending for the programming assignment. But in the dashboard, it shows 67% only. Recommended: Mention what you have done till now to f...",
    "created_at": "2025-01-26",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unknown-topic/165287"
  }
]